espressif/esp-idf/components/soc/esp32s3/include/soc/world_controller_struct.h
            uint32_t reserved6                     :    26;
        };
        uint32_t val;
    } wcl_core_1_statustable6;
    union {
        struct {
            uint32_t reg_core_1_from_world_7       :    1;  /*This bit is used to confirm world before enter entry 7 */
            uint32_t reg_core_1_from_entry_7       :    4;  /*This filed is used to confirm in which entry before enter entry 7*/
            uint32_t reg_core_1_current_7          :    1;  /*This bit is used to confirm whether the current state is in entry 7 */
            uint32_t reserved6                     :    26;
        };
        uint32_t val;
    } wcl_core_1_statustable7;
    union {
        struct {
            uint32_t reg_core_1_from_world_8       :    1;  /*This bit is used to confirm world before enter entry 8 */
            uint32_t reg_core_1_from_entry_8       :    4;  /*This filed is used to confirm in which entry before enter entry 8*/
            uint32_t reg_core_1_current_8          :    1;  /*This bit is used to confirm whether the current state is in entry 8 */
            uint32_t reserved6                     :    26;
        };
        uint32_t val;
    } wcl_core_1_statustable8;
    union {
        struct {
            uint32_t reg_core_1_from_world_9       :    1;  /*This bit is used to confirm world before enter entry 9 */
            uint32_t reg_core_1_from_entry_9       :    4;  /*This filed is used to confirm in which entry before enter entry 9*/
            uint32_t reg_core_1_current_9          :    1;  /*This bit is used to confirm whether the current state is in entry 9 */
            uint32_t reserved6                     :    26;
        };
        uint32_t val;
    } wcl_core_1_statustable9;
    union {
        struct {
            uint32_t reg_core_1_from_world_10      :    1;  /*This bit is used to confirm world before enter entry 10 */
            uint32_t reg_core_1_from_entry_10      :    4;  /*This filed is used to confirm in which entry before enter entry 10*/
            uint32_t reg_core_1_current_10         :    1;  /*This bit is used to confirm whether the current state is in entry 10 */
            uint32_t reserved6                     :    26;
        };
        uint32_t val;
    } wcl_core_1_statustable10;
    union {
        struct {
            uint32_t reg_core_1_from_world_11      :    1;  /*This bit is used to confirm world before enter entry 11 */
            uint32_t reg_core_1_from_entry_11      :    4;  /*This filed is used to confirm in which entry before enter entry 11*/
            uint32_t reg_core_1_current_11         :    1;  /*This bit is used to confirm whether the current state is in entry 11 */
            uint32_t reserved6                     :    26;
        };
        uint32_t val;
    } wcl_core_1_statustable11;
    union {
        struct {
            uint32_t core_1_from_world_12          :    1;  /*This bit is used to confirm world before enter entry 12 */
            uint32_t core_1_from_entry_12          :    4;  /*This filed is used to confirm in which entry before enter entry 12*/
            uint32_t core_1_current_12             :    1;  /*This bit is used to confirm whether the current state is in entry 12 */
            uint32_t reserved6                     :    26;
        };
        uint32_t val;
    } wcl_core_1_statustable12;
    union {
        struct {
            uint32_t reg_core_1_from_world_13      :    1;  /*This bit is used to confirm world before enter entry 13 */
            uint32_t reg_core_1_from_entry_13      :    4;  /*This filed is used to confirm in which entry before enter entry 13*/
            uint32_t reg_core_1_current_13         :    1;  /*This bit is used to confirm whether the current state is in entry 13 */
            uint32_t reserved6                     :    26;
        };
        uint32_t val;
    } wcl_core_1_statustable13;
    uint32_t reserved_4b4;
    uint32_t reserved_4b8;
    uint32_t reserved_4bc;
    uint32_t reserved_4c0;
    uint32_t reserved_4c4;
    uint32_t reserved_4c8;
    uint32_t reserved_4cc;
    uint32_t reserved_4d0;
    uint32_t reserved_4d4;
    uint32_t reserved_4d8;
    uint32_t reserved_4dc;
    uint32_t reserved_4e0;
    uint32_t reserved_4e4;
    uint32_t reserved_4e8;
    uint32_t reserved_4ec;
    uint32_t reserved_4f0;
    uint32_t reserved_4f4;
    uint32_t reserved_4f8;
    union {
        struct {
            uint32_t reserved0                     :    1;
            uint32_t reg_core_1_statustable_current:    13;  /*This field is used to quickly read and rewrite the current field of all STATUSTABLE registers.For example*/
            uint32_t reserved14                    :    18;
        };
        uint32_t val;
    } wcl_core_1_statustable_current;
    uint32_t reserved_500;
    uint32_t reserved_504;
    union {
        struct {
            uint32_t reg_core_1_message_match      :    1;  /*This bit indicates whether the check is successful*/
            uint32_t reg_core_1_message_expect     :    4;  /*This field indicates the data to be written next time*/
            uint32_t reg_core_1_message_dataphase  :    1;  /*If this bit is 1*/
            uint32_t reg_core_1_message_addressphase:    1;  /*If this bit is 1*/
            uint32_t reserved7                     :    25;
        };
        uint32_t val;
    } wcl_core_1_message_phase;
    uint32_t reserved_50c;
    uint32_t reserved_510;
    uint32_t reserved_514;
    uint32_t reserved_518;
    uint32_t reserved_51c;
    uint32_t reserved_520;
    uint32_t reserved_524;
    uint32_t reserved_528;
    uint32_t reserved_52c;
    uint32_t reserved_530;
    uint32_t reserved_534;
    uint32_t reserved_538;
    uint32_t reserved_53c;
    uint32_t wcl_core_1_world_trigger_addr;
    union {
        struct {
            uint32_t reg_core_1_world_prepare      :    2;  /*This field to used to set world to enter*/
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } wcl_core_1_world_prepare;
    uint32_t wcl_core_1_world_update;
    uint32_t wcl_core_1_world_cancel;
    union {
        struct {
            uint32_t reg_core_1_world_iram0        :    2;  /*this field is used to read current world of Iram0 bus*/
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } wcl_core_1_world_iram0;
    union {
        struct {
            uint32_t reg_core_1_world_dram0_pif    :    2;  /*this field is used to read current world of Dram0 bus and PIF bus*/
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } wcl_core_1_world_dram0_pif;
    union {
        struct {
            uint32_t reg_core_1_world_phase        :    1;  /*This bit indicates whether is preparing to switch to WORLD1*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } wcl_core_1_world_phase;
    uint32_t reserved_55c;
    uint32_t reserved_560;
    uint32_t reserved_564;
    uint32_t reserved_568;
    uint32_t reserved_56c;
    uint32_t reserved_570;
    uint32_t reserved_574;
    uint32_t reserved_578;
    uint32_t reserved_57c;
    uint32_t wcl_core_1_nmi_mask_enable;
    uint32_t wcl_core_1_nmi_mask_trigger_addr;
    uint32_t wcl_core_1_nmi_mask_disable;
    uint32_t wcl_core_1_nmi_mask_cancle;
    union {
        struct {
            uint32_t reg_core_1_nmi_mask           :    1;  /*this bit is used to mask NMI interrupt*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } wcl_core_1_nmi_mask;
    union {
        struct {
            uint32_t reg_core_1_nmi_mask_phase     :    1;  /*this bit is used to indicates whether the NMI interrupt is being masked*/
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } wcl_core_1_nmi_mask_phase;
} world_controller_dev_t;
extern world_controller_dev_t WORLD_CONTROLLER;
#ifdef __cplusplus
}
#endif



#endif /*_SOC_WORLD_CONTROLLER_STRUCT_H_ */
